diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Отпуска</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыФормы = Параметры;
	Адрес = ПараметрыФормы.Адрес;
	ТаблицаЗначений = ПолучитьИзВременногоХранилища(Адрес);
	
	ДГ.Обновление = Ложь;
    ДГ.Очистить();
    
	ДГ.АвтоОпределениеПолногоИнтервала = Ложь;
	ДГ.УстановитьПолныйИнтервал(НачалоГода(ПараметрыФормы.Период),КонецГода(ПараметрыФормы.Период) );

	Серия = ДГ.УстановитьСерию("Отпуска");
		
	Для Каждого СтрокаТЗ ИЗ ТаблицаЗначений Цикл
    	Точка = ДГ.УстановитьТочку(СтрокаТЗ.Сотрудник);
    	Точка.Текст = СтрокаТЗ.Сотрудник;
    	
    	Значение = ДГ.ПолучитьЗначение(Точка, Серия);

        Интервал = Значение.Добавить();

        Интервал.Начало = СтрокаТЗ.ДатаНачала;

        Интервал.Конец = СтрокаТЗ.ДатаОкончания;

КонецЦикла;

ДГ.Обновление = Истина;

КонецПроцедуры

#КонецОбласти
